tap "dart-lang/dart"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "oven-sh/bun"
brew "actionlint"
brew "awscli"
brew "node"
brew "bitwarden-cli"
brew "glib"
brew "cocoapods"
brew "deno"
brew "fcrackzip"
brew "fd"
brew "fzf"
brew "gat"
brew "harfbuzz"
brew "libtiff"
brew "little-cms2"
brew "openjpeg"
brew "webp"
brew "leptonica"
brew "libarchive"
brew "pango"
brew "tesseract"
brew "ghostscript"
brew "ghq"
brew "gibo"
brew "git"
brew "git-delta"
brew "git-secrets"
brew "gitleaks"
brew "jq"
brew "lazygit"
brew "lua"
brew "mise"
brew "mysql"
brew "neofetch"
brew "neovim"
brew "peco"
brew "postgresql@14"
brew "ripgrep"
brew "ruff"
brew "rustup"
brew "starship"
brew "tree"
brew "xh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-vi-mode"
cask "alt-tab"
cask "android-studio"
cask "appcleaner"
cask "applite"
cask "blackhole-2ch"
cask "docker"
cask "evernote"
cask "font-daddy-time-mono-nerd-font"
cask "font-fira-code"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono"
cask "font-meslo-lg-nerd-font"
cask "karabiner-elements"
cask "kindle"
cask "microsoft-auto-update"
cask "microsoft-teams"
cask "monitorcontrol"
cask "neovide"
cask "openineditor-lite"
cask "openinterminal-lite"
cask "postman"
cask "slack"
cask "the-unarchiver"
cask "transmission"
cask "wezterm"
cask "xld"
cask "zed"
cask "zoom"
vscode "1natsu.insert-br-tag"
vscode "1yib.rust-bundle"
vscode "adam-watters.vscode-color-pick"
vscode "adpyke.codesnap"
vscode "adrianwilczynski.toggle-hidden"
vscode "aeschli.vscode-css-formatter"
vscode "alefragnani.bookmarks"
vscode "alefragnani.project-manager"
vscode "alexandernanberg.horizon-theme-vscode"
vscode "alexcvzz.vscode-sqlite"
vscode "anilbeesetti.evans-dark-theme"
vscode "arcticicestudio.nord-visual-studio-code"
vscode "arjun.swagger-viewer"
vscode "asvetliakov.vscode-neovim"
vscode "avetis.nord-palette"
vscode "aziznal.dart-import-sorter"
vscode "batisteo.vscode-django"
vscode "be5invis.toml"
vscode "bierner.jsdoc-markdown-highlighting"
vscode "blaugold.melos-code"
vscode "cameron.vscode-pytest"
vscode "chakrounanas.turbo-console-log"
vscode "chrischinchilla.vscode-pandoc"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "ckolkman.vscode-postgres"
vscode "codezombiech.gitignore"
vscode "cschlosser.doxdocgen"
vscode "cstrap.python-snippets"
vscode "dahong.theme-bear"
vscode "daiyy.quick-html-previewer"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "deerawan.vscode-dash"
vscode "developer2006.svg-gallery"
vscode "dnlytras.nord-wave"
vscode "donjayamanne.githistory"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "dustypomerleau.rust-syntax"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "equinusocio.vsc-material-theme"
vscode "esbenp.prettier-vscode"
vscode "firsttris.vscode-jest-runner"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "genieai.chatgpt-vscode"
vscode "gera2ld.markmap-vscode"
vscode "gerane.theme-monokai-cobalt"
vscode "github.github-vscode-theme"
vscode "github.remotehub"
vscode "gruntfuggly.activitusbar"
vscode "gruntfuggly.todo-tree"
vscode "haack.warp-companion"
vscode "harg.iceberg"
vscode "harryhopkinson.vim-theme"
vscode "hbenl.vscode-test-explorer"
vscode "huytd.nord-light"
vscode "ibm.output-colorizer"
vscode "ics.japanese-proofreading"
vscode "inferrinizzard.prettier-sql-vscode"
vscode "intellsmi.comment-translate"
vscode "ionutvmi.path-autocomplete"
vscode "janisdd.vscode-edit-csv"
vscode "jevakallio.vscode-live-frame"
vscode "jithurjacob.nbpreviewer"
vscode "johnpapa.vscode-peacock"
vscode "josetr.cmake-language-support-vscode"
vscode "julianiaquinandi.nvim-ui-modifier"
vscode "jumpinjackie.vscode-map-preview"
vscode "kevinrose.vsc-python-indent"
vscode "kirozen.wordcounter"
vscode "koehlma.markdown-math"
vscode "liviuschera.noctis"
vscode "lokalise.i18n-ally"
vscode "lucono.karma-test-explorer"
vscode "marlosirapuan.nord-deep"
vscode "marp-team.marp-vscode"
vscode "matangover.mypy"
vscode "mathpix.vscode-mathpix-markdown"
vscode "mechatroner.rainbow-csv"
vscode "mgesbert.python-path"
vscode "mhutchie.git-graph"
vscode "mikestead.dotenv"
vscode "moalamri.inline-fold"
vscode "moshfeu.compare-folders"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.autopep8"
vscode "ms-python.debugpy"
vscode "ms-python.flake8"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vsliveshare.vsliveshare"
vscode "mushan.vscode-open-iterm2"
vscode "mylesmurphy.prettify-ts"
vscode "nanowise.nanowise-dark"
vscode "natqe.reload"
vscode "njpwerner.autodocstring"
vscode "njqdev.vscode-python-typehint"
vscode "npxms.hide-gitignored"
vscode "oderwat.indent-rainbow"
vscode "openai.openai-chatgpt-adhoc"
vscode "orta.vscode-jest"
vscode "oven.bun-vscode"
vscode "peakchen90.open-html-in-browser"
vscode "pflannery.vscode-versionlens"
vscode "pkief.markdown-checkbox"
vscode "pkief.material-icon-theme"
vscode "pkief.material-product-icons"
vscode "pranaygp.vscode-css-peek"
vscode "qwtel.sqlite-viewer"
vscode "raidxu.logcat-color"
vscode "redhat.java"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-yaml"
vscode "renesaarsoo.sql-formatter-vsc"
vscode "ritwickdey.liveserver"
vscode "rust-lang.rust-analyzer"
vscode "ryanluker.vscode-coverage-gutters"
vscode "ryu1kn.text-marker"
vscode "saikou9901.evilinspector"
vscode "shardulm94.trailing-spaces"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "simonsiefke.svg-preview"
vscode "slightc.pip-manager"
vscode "sonarsource.sonarlint-vscode"
vscode "spacek33z.vscode-open-in-gitfork"
vscode "spmeesseman.vscode-taskexplorer"
vscode "streetsidesoftware.code-spell-checker"
vscode "stylelint.vscode-stylelint"
vscode "tal7aouy.theme"
vscode "teabyii.ayu"
vscode "tomsaunders.vscode-workspace-explorer"
vscode "twxs.cmake"
vscode "uctakeoff.vscode-counter"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "vector-of-bool.gitflow"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vmsynkov.colonize"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscode-icons-team.vscode-icons"
vscode "vue.volar"
vscode "wayou.vscode-icons-mac"
vscode "wesbos.theme-cobalt2"
vscode "wmaurer.change-case"
vscode "wraith13.bracket-lens"
vscode "xabikos.javascriptsnippets"
vscode "yoshi389111.visible-whitespace"
vscode "yuna611d.grep2file"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"
vscode "zainchen.json"
vscode "zignd.html-css-class-completion"
