tap "dart-lang/dart"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "oven-sh/bun"
brew "actionlint"
brew "awscli"
brew "node"
brew "bitwarden-cli"
brew "glib"
brew "cocoapods"
brew "deno"
brew "fcrackzip"
brew "fd"
brew "fzf"
brew "gat"
brew "harfbuzz"
brew "libtiff"
brew "little-cms2"
brew "openjpeg"
brew "webp"
brew "leptonica"
brew "libarchive"
brew "pango"
brew "tesseract"
brew "ghostscript"
brew "ghq"
brew "gibo"
brew "git"
brew "git-delta"
brew "git-secrets"
brew "gitleaks"
brew "jq"
brew "lazygit"
brew "lua"
brew "mise"
brew "mysql"
brew "neofetch"
brew "neovim"
brew "peco"
brew "postgresql@14"
brew "ripgrep"
brew "ruff"
brew "rustup"
brew "starship"
brew "tree"
brew "xh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-vi-mode"
cask "alt-tab"
cask "android-studio"
cask "appcleaner"
cask "applite"
cask "blackhole-2ch"
cask "docker"
cask "evernote"
cask "font-daddy-time-mono-nerd-font"
cask "font-fira-code"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono"
cask "font-meslo-lg-nerd-font"
cask "karabiner-elements"
cask "kindle"
cask "microsoft-auto-update"
cask "microsoft-teams"
cask "monitorcontrol"
cask "neovide"
cask "openineditor-lite"
cask "openinterminal-lite"
cask "postman"
cask "slack"
cask "the-unarchiver"
cask "transmission"
cask "wezterm"
cask "xld"
cask "zed"
cask "zoom"
vscode "1yib.rust-bundle"
vscode "adrianwilczynski.toggle-hidden"
vscode "alefragnani.project-manager"
vscode "alexandernanberg.horizon-theme-vscode"
vscode "anilbeesetti.evans-dark-theme"
vscode "arcticicestudio.nord-visual-studio-code"
vscode "asvetliakov.vscode-neovim"
vscode "avetis.nord-palette"
vscode "aziznal.dart-import-sorter"
vscode "be5invis.toml"
vscode "cameron.vscode-pytest"
vscode "christian-kohler.path-intellisense"
vscode "cstrap.python-snippets"
vscode "daiyy.quick-html-previewer"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "developer2006.svg-gallery"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "dustypomerleau.rust-syntax"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "equinusocio.vsc-material-theme"
vscode "esbenp.prettier-vscode"
vscode "firsttris.vscode-jest-runner"
vscode "gerane.theme-monokai-cobalt"
vscode "github.remotehub"
vscode "harg.iceberg"
vscode "huytd.nord-light"
vscode "ionutvmi.path-autocomplete"
vscode "johnpapa.vscode-peacock"
vscode "liviuschera.noctis"
vscode "lokalise.i18n-ally"
vscode "marlosirapuan.nord-deep"
vscode "marp-team.marp-vscode"
vscode "mechatroner.rainbow-csv"
vscode "mgesbert.python-path"
vscode "mhutchie.git-graph"
vscode "mikestead.dotenv"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.test-adapter-converter"
vscode "mushan.vscode-open-iterm2"
vscode "mylesmurphy.prettify-ts"
vscode "natqe.reload"
vscode "njpwerner.autodocstring"
vscode "njqdev.vscode-python-typehint"
vscode "npxms.hide-gitignored"
vscode "oderwat.indent-rainbow"
vscode "oven.bun-vscode"
vscode "pkief.material-icon-theme"
vscode "pkief.material-product-icons"
vscode "redhat.vscode-yaml"
vscode "renesaarsoo.sql-formatter-vsc"
vscode "ritwickdey.liveserver"
vscode "rust-lang.rust-analyzer"
vscode "saikou9901.evilinspector"
vscode "shardulm94.trailing-spaces"
vscode "simonsiefke.svg-preview"
vscode "spacek33z.vscode-open-in-gitfork"
vscode "streetsidesoftware.code-spell-checker"
vscode "tal7aouy.theme"
vscode "teabyii.ayu"
vscode "tomsaunders.vscode-workspace-explorer"
vscode "usernamehw.errorlens"
vscode "vector-of-bool.gitflow"
vscode "vscode-icons-team.vscode-icons"
vscode "wesbos.theme-cobalt2"
vscode "yoshi389111.visible-whitespace"
vscode "yzhang.markdown-all-in-one"
vscode "zainchen.json"
vscode "zignd.html-css-class-completion"
