tap "arto-app/tap", trusted: true
tap "felixkratz/formulae", trusted: true
tap "homebrew/bundle"
tap "homebrew/services"
# Core application library for C
brew "glib"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Access GitHub's .gitignore boilerplates
brew "gibo"
# Distributed revision control system
brew "git"
# Prevents you from committing sensitive information to a git repo
brew "git-secrets"
# OpenType text shaping engine
brew "harfbuzz"
# TIFF library and utilities
brew "libtiff"
# Color management engine supporting ICC profiles
brew "little-cms2"
# Library for JPEG-2000 image manipulation
brew "openjpeg"
# Image format providing lossless and lossy compression for web images
brew "webp"
# Image processing and image analysis library
brew "leptonica"
# Multi-format archive and compression library
brew "libarchive"
# Mac App Store command-line interface
brew "mas"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Wrapper to colorize and simplify ping's output
brew "prettyping"
# Rust toolchain installer
brew "rustup"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# Prints a steam locomotive if you type sl instead of ls
brew "sl"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# A window border system for macOS
brew "felixkratz/formulae/borders"
# Custom macOS statusbar with shell plugin, interaction and graph support
brew "felixkratz/formulae/sketchybar"
# Tools for building Android applications
cask "android-studio"
# Application uninstaller
cask "appcleaner"
# The Art of Reading Markdown.
cask "arto-app/tap/arto"
# Display management tool
cask "betterdisplay"
# Desktop password and login vault
cask "bitwarden"
# OpenAI's Codex desktop app for managing coding agents
cask "codex-app"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# App for note taking, organising, task lists, and archiving
cask "evernote"
# Collaborative team software
cask "figma"
cask "font-fira-code"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono"
cask "font-moralerspace"
cask "font-symbols-only-nerd-font"
# GIT client
cask "fork"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Java IDE by JetBrains
cask "intellij-idea"
# Menu bar manager
cask "jordanbaird-ice"
# Keyboard customiser
cask "karabiner-elements"
# Find shortcuts for any installed application
cask "keyclu"
# Interface for reading and syncing eBooks
cask "kindle"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# Finder Toolbar app to open the current directory in Editor
cask "openineditor-lite"
# Finder Toolbar app to open the current directory in Terminal
cask "openinterminal-lite"
# Used to access context-specific actions when text is selected
cask "popclip"
# Collaboration platform for API development
cask "postman"
# Control your tools with a few keystrokes
cask "raycast"
# Tool that provides consistent, highly configurable symbols for apps
cask "sf-symbols"
# Team communication and collaboration software
cask "slack"
# Unpacks archive files
cask "the-unarchiver"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
# Install and switch between multiple versions of Xcode
cask "xcodes-app"
# Lossless audio decoder
cask "xld"
# Video communication and virtual meeting platform
cask "zoom"
mas "Adblock Plus", id: 1432731683
mas "AdGuard for Safari", id: 1440147259
mas "BetterSnapTool", id: 417375580
mas "CotEditor", id: 1024640650
mas "GIPHY CAPTURE", id: 668208984
mas "Grila", id: 6444335028
mas "Keepa - Price Tracker", id: 1533805339
mas "Kindle", id: 302584613
mas "LINE", id: 539883307
mas "Magnet", id: 441258766
mas "Numbers", id: 361304891
mas "Numbers", id: 409203825
mas "RunCat", id: 1429033973
mas "Save to Raindrop.io", id: 1549370672
mas "Spark", id: 1176895641
mas "Table Tool", id: 1122008420
vscode "1yib.rust-bundle"
vscode "3w36zj6.textlint"
vscode "alefragnani.project-manager"
vscode "anilbeesetti.evans-dark-theme"
vscode "antfu.browse-lite"
vscode "arcticicestudio.nord-visual-studio-code"
vscode "asvetliakov.vscode-neovim"
vscode "avetis.nord-palette"
vscode "aziznal.dart-import-sorter"
vscode "be5invis.toml"
vscode "blaugold.melos-code"
vscode "cameron.vscode-pytest"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "christian-kohler.path-intellisense"
vscode "cstrap.python-snippets"
vscode "daiyy.quick-html-previewer"
vscode "darkriszty.markdown-table-prettify"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "developer2006.svg-gallery"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "dustypomerleau.rust-syntax"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "esafirm.kotlin-formatter"
vscode "esbenp.prettier-vscode"
vscode "firsttris.vscode-jest-runner"
vscode "foam.foam-vscode"
vscode "foxundermoon.shell-format"
vscode "fwcd.kotlin"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "golang.go"
vscode "hverlin.mise-vscode"
vscode "ionutvmi.path-autocomplete"
vscode "jishii1204.markdown-live-editor"
vscode "johnnymorganz.stylua"
vscode "johnpapa.vscode-peacock"
vscode "kdl-org.kdl"
vscode "liviuschera.noctis"
vscode "marlosirapuan.nord-deep"
vscode "mathiasfrohlich.kotlin"
vscode "mechatroner.rainbow-csv"
vscode "mgesbert.python-path"
vscode "mhutchie.git-graph"
vscode "miguelsolorio.fluent-icons"
vscode "mikestead.dotenv"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "mushan.vscode-open-iterm2"
vscode "mylesmurphy.prettify-ts"
vscode "natqe.reload"
vscode "njpwerner.autodocstring"
vscode "njqdev.vscode-python-typehint"
vscode "npxms.hide-gitignored"
vscode "oderwat.indent-rainbow"
vscode "openai.chatgpt"
vscode "oven.bun-vscode"
vscode "pkief.material-icon-theme"
vscode "redhat.vscode-yaml"
vscode "renesaarsoo.sql-formatter-vsc"
vscode "ritwickdey.liveserver"
vscode "rust-lang.rust-analyzer"
vscode "s1e2b3i4.onenord-vscode"
vscode "saikou9901.evilinspector"
vscode "shardulm94.trailing-spaces"
vscode "simonsiefke.svg-preview"
vscode "spacek33z.vscode-open-in-gitfork"
vscode "streetsidesoftware.code-spell-checker"
vscode "sumneko.lua"
vscode "tamasfe.even-better-toml"
vscode "teabyii.ayu"
vscode "timonwong.shellcheck"
vscode "usernamehw.errorlens"
vscode "vscode-icons-team.vscode-icons"
vscode "wesbos.theme-cobalt2"
vscode "yoshi389111.visible-whitespace"
vscode "yoshi47.selection-path-copier"
vscode "yzhang.markdown-all-in-one"
vscode "zainchen.json"
vscode "zignd.html-css-class-completion"
go "cmd/go"
go "cmd/gofmt"
uv "specify-cli"
npm "@anthropic-ai/claude-code"
npm "corepack"
